coffee =[]
# coffee.append("커피콩")
coffee.append({
    "커피원산지" : ["에티오피아", "케냐", "콜롬비아", "브라질", "베트남"]
})
# coffee.append("물")
coffee.append({
    "물종류" : ["삼다수", "수돗물", "석수", "백산수", "아이시스"]
})
# coffee.append("얼음")
coffee.append({
    "아이스버전" : ["냉장고얼음", "공업용얼음", "고드름", "각얼음", "끓인얼음", "석빙고얼음"]
})
# coffee.append("드로퍼")
coffee.append({
    "기계" : ["원두를내리는필터", "압착", "머그잔", "테이크아웃", "유리잔"]
})

print(coffee)
print("----------------------------------------")
print(coffee[1])
print("----------------------------------------")
print(len(coffee[0]["커피원산지"]))
print("----------------------------------------")
print(coffee[0]["커피원산지"])
print("----------------------------------------")
coffee[0]["커피원산지"].append("루왁커피")
print(coffee[0]["커피원산지"])
print("----------------------------------------")
coffee[1]["물종류"].remove("삼다수")
coffee[1]["물종류"].append("에비앙")
print(coffee[1]["물종류"])

# 아이스아메리카노 만들기
# 주문
#   아이스 아메리카노 한잔 주시는데 
#   원두는 에티오피아
#   물은 백산수
#   얼음은 각얼음
#   기계는 테이크아웃
#   으로 부탁드릴게요

# menu = {
#     "아이스아메리카노" : [ coffee[0]["커피원산지"][0], coffee[1]["물종류"]["백산수"], coffee[2]["아이스버전"]["각얼음"], coffee[3]["기계"]["테이크아웃"]]
# }
# print(menu["아이스아메리카노"])
